;
; IN-12 NIXIE CLOCK WOOD.asm
;
; Created: 21.03.2023 13:03:44
; Author : MikhnovetsA (Михновец Александр Владимирович, Россия, г.Челябинск)
; e-mail: sasha_mihnovets@mail.ru
; Программа для часов с газоразряжными индикаторами ИН-12 (6 штук) под управлением микроконтроллера ATmega8 
; и микросхемы часов реального времени DS1307.

; F_CPU = 8 MHz
.device ATmega8
.include "m8def.inc"

; Дефайны и переменные =========================================================================================================
.def temp = r16					; Временная переменная
.def Razryad = r17				; Для переключения индикаторов (значения от 0 до 5)

; Таблица векторов прерываний ==================================================================================================
.include "vectors.inc"
; Макросы ======================================================================================================================
.include "macro.inc"
; Обработчики прерываний =======================================================================================================
.include "interrupts.inc"
; Процедуры ====================================================================================================================
.include "procedures.inc"

.DSEG ; Область оперативной памяти ОЗУ =========================================================================================
	.org SRAM_START		; Начало оперативной памяти (за всеми регистрами ввода-вывода)

.CSEG ; Область флэш памяти ПЗУ ================================================================================================
; Начало программы
Reset:	
	.include "ini.inc"	; Инициализация стека, перифирии и т.д.

    sei					; Разрешаю глобальные прерывания

    rjmp Reset
