;
; IN-12 NIXIE CLOCK WOOD.asm
;
; Created: 21.03.2023 13:03:44
; Author : MikhnovetsA (Михновец Александр Владимирович, Россия, г.Челябинск)
; e-mail: sasha_mihnovets@mail.ru
; Программа для часов с газоразряжными индикаторами ИН-12 (6 штук) под управлением микроконтроллера ATmega8 
; и микросхемы часов реального времени DS1307.

.device ATmega8
.include "m8def.inc"

; Дефайны и переменные =========================================================================================================
.def temp = r16			; Временная переменная

; Таблица векторов прерываний ==================================================================================================
.org $000
	rjmp Reset
.org $001
	rjmp DS1307_SQW
.org $003
	rjmp TIMER2_COMPARE
.org $004
	rjmp TIMER2_OVF
.org $006 
	rjmp TIMER1_COMPA
.org $007
	rjmp TIMER1_COMPB
.org $008 
	rjmp TIMER1_OVF
.org $009 
	rjmp TIMER0_OVF
.org $00e
	rjmp ADC_READY
.org $00f
	rjmp EE_READY
.org INT_VECTORS_SIZE

; Макросы ======================================================================================================================

; Обработчики прерываний =======================================================================================================
DS1307_SQW:	; Прерывание от импульса от микросхемы часов (раз в 1 секунду)

ret

TIMER2_COMPARE:

ret

TIMER2_OVF:

ret

TIMER1_COMPA:

ret

TIMER1_COMPB:

ret

TIMER1_OVF:

ret

TIMER0_OVF:

ret

ADC_READY:

ret

EE_READY:

ret

; Процедуры ====================================================================================================================

.DSEG ; Область оперативной памяти ОЗУ =========================================================================================
	.org SRAM_START		; Начало оперативной памяти (за всеми регистрами ввода-вывода)

.CSEG ; Область флэш памяти ПЗУ ================================================================================================
; Начало программы
Reset:	
    nop
    rjmp Reset
