;
; IN-12 NIXIE CLOCK WOOD.asm
;
; Created: 21.03.2023 13:03:44
; Author : MikhnovetsA (Михновец Александр Владимирович, Россия, г.Челябинск)
; e-mail: sasha_mihnovets@mail.ru
; Программа для часов с газоразряжными индикаторами ИН-12 (6 штук) под управлением микроконтроллера ATmega8 
; и микросхемы часов реального времени DS1307.

; F_CPU = 8 MHz
.device ATmega8
.include "m8def.inc"

; Дефайны и переменные =========================================================================================================
.def temp			= r16		; Временная переменная 1
.def temp1			= r17		; Временная переменная 2
.def Razryad		= r19		; Для переключения индикаторов (значения от 0 до 5)
.def Sec_counter	= r22		; Счётчик секунд
.def Min_counter	= r23		; Счётчик минут
.def Hour_counter	= r24		; Счётчик часов
.equ T1 = 6						; Индикатор десятков часов
.equ T2 = 7						; Индикатор единиц часов
.equ T3 = 5						; Индикатор десятков минут
.equ T4 = 6						; Индикатор единиц минут
.equ T5 = 7						; Индикатор десятков секунд
.equ T6 = 0						; Индикатор единиц секунд

; Таблица векторов прерываний ==================================================================================================
.include "vectors.inc"
; Макросы ======================================================================================================================
.include "macro.inc"
; Обработчики прерываний =======================================================================================================
.include "interrupts.inc"
; Процедуры ====================================================================================================================
.include "procedures.inc"

.DSEG ; Область оперативной памяти ОЗУ =========================================================================================
				.org SRAM_START		; Начало оперативной памяти (за всеми регистрами ввода-вывода)
	; Резервирование памяти для распакованных и упакованных значений времени
	Sec_l_BCD:	.byte	1			; Единицы секунд (low BCD)
	Sec_h_BCD:	.byte	1			; Десятки секунд (high BCD)
	Sec_pac:	.byte	1			; Секунды в упауованном BCD формате
	Min_l_BCD:	.byte	1			; Единицы минут (low BCD)
	Min_h_BCD:	.byte	1			; Десятки минут	(high BCD)
	Min_pac:	.byte	1			; Минуты в упакованном BCD формате
	Hour_l_BCD:	.byte	1			; Единицы часов (low BCD)
	Hour_h_BCD:	.byte	1			; Десятки часов (high BCD)
	Hour_pac:	.byte	1			; Часы в упакованном BCD формате

.CSEG ; Область флэш памяти ПЗУ ================================================================================================

Numbers:
; Массив цифр для дешифратора (не по порядку из-за дурацкой разводки)
;	0	 1	  2	   3	4	 5	  6	   7	8	 9
.db $00, $01, $04, $05, $08, $09, $0C, $0D, $02, $03

; Начало программы
Reset:
	
	.include "flush.inc"; Очистка памяти от мусора
	.include "ini.inc"	; Инициализация стека, перифирии и т.д.

	; Установка времени (временная)
	
	ldi Min_counter, 56
	mov temp, Min_counter
	rcall bin2bcd8				; На выходе в temp1 десятки, в temp единицы минут
	ldi YL, low(Min_l_BCD)		; Адрес единиц минут в ОЗУ
	st Y+, temp					; Сохраняем единицы минут в ОЗУ
	st Y, temp1					; Сохраняем десятки минут в ОЗУ

	clr temp1
	
	ldi Hour_counter, 13
	mov temp, Hour_counter		; Значение часов в temp
	rcall bin2bcd8				; На выходе в temp1 десятки, в temp единицы часов
	ldi YL, low(Hour_l_BCD)		; Адрес единиц часов в ОЗУ
	st Y+, temp					; Сохраняем единицы часов в ОЗУ
	st Y, temp1					; Сохраняем десятки часов в ОЗУ


	
    sei						; Разрешаю глобальные прерывания

	LOOP:					; Основной цикл программы

		
	
    rjmp LOOP

