;
; IN-12 NIXIE CLOCK WOOD.asm
;
; Created: 21.03.2023 13:03:44
; Author : MikhnovetsA (Михновец Александр Владимирович, Россия, г.Челябинск)
; e-mail: sasha_mihnovets@mail.ru
; Программа для часов с газоразряжными индикаторами ИН-12 (6 штук) под управлением микроконтроллера ATmega8 
; и микросхемы часов реального времени DS1307.

; F_CPU = 8 MHz
.device ATmega8
.include "m8def.inc"

; Дефайны и переменные =========================================================================================================
.def temp = r16					; Временная переменная
.def Razryad = r17				; Для переключения индикаторов (значения от 0 до 5)
.def Razr1 = r18
.def Razr0 = r19
.equ T1 = 6						; Индикатор десятков часов
.equ T2 = 7						; Индикатор единиц часов
.equ T3 = 5						; Индикатор десятков минут
.equ T4 = 6						; Индикатор единиц минут
.equ T5 = 7						; Индикатор десятков секунд
.equ T6 = 0						; Индикатор единиц секунд

; Таблица векторов прерываний ==================================================================================================
.include "vectors.inc"
; Макросы ======================================================================================================================
.include "macro.inc"
; Обработчики прерываний =======================================================================================================
.include "interrupts.inc"
; Процедуры ====================================================================================================================
.include "procedures.inc"

.DSEG ; Область оперативной памяти ОЗУ =========================================================================================
	.org SRAM_START		; Начало оперативной памяти (за всеми регистрами ввода-вывода)

.CSEG ; Область флэш памяти ПЗУ ================================================================================================
; Начало программы
Reset:	
	.include "ini.inc"	; Инициализация стека, перифирии и т.д.

    //sei					; Разрешаю глобальные прерывания
	sbi PORTC, 2
	//sbi PORTC, 3
	sbi PORTC, 0

	//sbi PORTB, T1		; Включаем первый индикатор (Т1)
	//cbi PORTB, T1
	//sbi PORTB, T2
	//sbi PORTD, T3
	//sbi PORTD, T4
	//sbi PORTD, T5
	//sbi PORTB, T6

	LOOP:
	
	sbi PORTB, T1
	Delay $FF, $FF
	cbi PORTB, T1
	sbi PORTB, T2
	Delay $FF, $FF
	cbi PORTB, T2
	sbi PORTD, T3
	Delay $FF, $FF
	cbi PORTD, T3
	sbi PORTD, T4
	Delay $FF, $FF
	cbi PORTD, T4
	sbi PORTD, T5
	Delay $FF, $FF
	cbi PORTD, T5
	sbi PORTB, T6
	Delay $FF, $FF
	cbi PORTB, T6
	
	nop
    rjmp LOOP
